# `rightmove_webscraper.py`
# Examples

In [1]:
from rightmove_webscraper import rightmove_data

## Example 1
### Scrape properties for sale:

Using a URL returned from searching rightmove.co.uk with the following criteria:

* Property for SALE
* Area = "Battersea Power Station"
* Radius = within 3 miles
* Price range, bedrooms = no min or max
* Property type = Any
* Added to site within =  last 7 days

In [2]:
sale_url = "https://www.rightmove.co.uk/property-for-sale/find.html?searchType=SALE&locationIdentifier=POSTCODE%5E1355398&insId=1&radius=1.0&minPrice=&maxPrice=&minBedrooms=&maxBedrooms=&displayPropertyType=&maxDaysSinceAdded=&_includeSSTC=on&sortByPriceDescending=&primaryDisplayPropertyType=&secondaryDisplayPropertyType=&oldDisplayPropertyType=&oldPrimaryDisplayPropertyType=&newHome=&auction=false"
# Care, only run this once a day
# Create the instance of the class on the search URL:
sale_object = rightmove_data(sale_url)
sale_object.results_count

655

In [3]:
# `average_price` give the mean price of all results returned:
sale_object.average_price

252455

In [4]:
# `summary` gives a summary by count and mean price:
sale_object.summary()

   number_bedrooms  count    mean
0                0     13  145058
1                1    227  180910
2                2    352  268580
3                3     41  465745
4                4     10  876994

In [5]:
# By default `summary` is group by number of bedrooms, but can also be grouped  
# by different features:
sale_object.summary(by="postcode").head()

  postcode  count    mean
0       M4    146  236418
1       M1    125  284559
2       M3     80  327101
3      M15     36  216771
4      M13      6  277495

In [6]:
# `get_results` method returns all listings in a Pandas dataframe:
sale_object.get_results.tail()

,price,type,address,url,agent_url,postcode,number_bedrooms,search_date
650,110000.0,1 bedroom flat for sale,"Apartment 219, Manchester, M15",http://www.rightmove.co.uk/property-for-sale/p...,http://www.rightmove.co.uk/estate-agents/agent...,M15,1,2019-02-12 13:46:51.052714
651,NaN,1 bedroom flat for sale,"Hotspur Press, Gloucester Street, Manchester, ...",http://www.rightmove.co.uk/property-for-sale/p...,http://www.rightmove.co.uk/estate-agents/agent...,M1,1,2019-02-12 13:46:51.052714
652,75000.0,Studio flat for sale,"Hyde Road, Manchester, Greater Manchester, M12",http://www.rightmove.co.uk/property-for-sale/p...,http://www.rightmove.co.uk/estate-agents/agent...,M12,0,2019-02-12 13:46:51.052714
653,69950.0,Studio apartment for sale,Hyde Road Ardwick Manchester,http://www.rightmove.co.uk/property-for-sale/p...,http://www.rightmove.co.uk/estate-agents/agent...,NaN,0,2019-02-12 13:46:51.052714
654,65000.0,1 bedroom apartment for sale,"56 High Street, Manchester, M4",http://www.rightmove.co.uk/property-for-sale/p...,http://www.rightmove.co.uk/estate-agents/agent...,M4,1,2019-02-12 13:46:51.052714

## Example 2
### Scrape properties for rent:

Using a URL returned from a same criteria as above, except searching for rental properties.

In [7]:
rent_url = "https://www.rightmove.co.uk/property-to-rent/find.html?\
searchType=RENT&locationIdentifier=REGION%5E94346&insId=1&radius=3.0&minPrice=\
&maxPrice=&minBedrooms=&maxBedrooms=&displayPropertyType=&maxDaysSinceAdded=7\
&sortByPriceDescending=&_includeLetAgreed=on&primaryDisplayPropertyType=\
&secondaryDisplayPropertyType=&oldDisplayPropertyType=\
&oldPrimaryDisplayPropertyType=&letType=&letFurnishType=&houseFlatShare="

# Create the instance of the class on the search URL:
rent_object = rightmove_data(rent_url)
rent_object.results_count

1050

In [8]:
rent_object.average_price

3241

In [9]:
rent_object.summary()

   number_bedrooms  count   mean
0                0     97   1360
1                1    305   2088
2                2    412   3100
3                3    154   5427
4                4     60   6004
5                5     12   9652
6                6      4   4854
7                7      1  21667

In [10]:
rent_object.summary(by="postcode").head()

  postcode  count  mean
0     SW11     66  2275
1      SW8     57  2509
2      SW6     53  2803
3       W2     51  3301
4      SW3     46  3980

In [11]:
rent_object.get_results.tail()

,price,type,address,url,agent_url,postcode,number_bedrooms,search_date
1045,2167,1 bedroom apartment,"The Corniche, Albert Embankment, London, SE1",http://www.rightmove.co.uk/property-to-rent/pr...,http://www.rightmove.co.uk/estate-agents/agent...,SE1,1,2018-07-25 13:03:09.965945
1046,1950,1 bedroom flat,"Ormonde Gate, LONDON, SW3",http://www.rightmove.co.uk/property-to-rent/pr...,http://www.rightmove.co.uk/estate-agents/agent...,SW3,1,2018-07-25 13:03:09.965945
1047,1842,2 bedroom apartment,"Fogerhill House, Ram Quarter, Wandsworth",http://www.rightmove.co.uk/property-to-rent/pr...,http://www.rightmove.co.uk/estate-agents/agent...,NaN,2,2018-07-25 13:03:09.965945
1048,19500,2 bedroom apartment,"Hertford Street, Mayfair, W1",http://www.rightmove.co.uk/property-to-rent/pr...,http://www.rightmove.co.uk/estate-agents/agent...,W1,2,2018-07-25 13:03:09.965945
1049,1842,Studio apartment,Doulton House Park Street SW6,http://www.rightmove.co.uk/property-to-rent/pr...,http://www.rightmove.co.uk/estate-agents/agent...,SW6,0,2018-07-25 13:03:09.965945